[

    {
        "id": "ant_maintenance_2025-12-09",
        "title": "VHF/UHF Antenna Maintenance on December 9, 2025",
        "date": "December 9, 2025",
        "description": "The club came together in the cold, dark, winter rain to do some maintenance on our VHF/UHF antennas. The basic goal was to move the 23cm yagi from a different tower to a higher position on the VHF/UHF tower as well as replace the old feedlines with better coax.",
        "image": "/images/IMG_0638.png",
        "content": "<p>The club came together in the cold, dark, winter rain to do some maintenance on our VHF/UHF antennas. The basic goal was to move the 23cm yagi from a different tower to a higher position on the VHF/UHF tower as well as replace the old feedlines with better coax.</p><p>Starting at 14:00, we started by removing the individual tower sections in our Unza tower, in order to lower the antennas.</p> <p>Then, we tied some heavy-duty tie-down straps to a guy wire mount on the roof and lowered the tower down on its side. Several members gradually lowered the tower via releasing the strap while the rest supported it as the tower gently laid down sideways.</p><p>Once the antennas could be reached, we removed the old 2m/70cm vertical antenna, as well as the old feed lines.</p><p>We moved the 23cm yagi from a lower position on a different tower to the top of the lowered tower.</p><p>After measuring, cutting, and assembling the new Ecoflex 15 feedlines, they were attached to all antennas.</p><p>Everyone came together to push the tower back up to its vertical position.</p><p>After some rotation testing, all was considered to be in working order, and the Maintenance party officially concluded around 22:30.</p><p>The result is a tower with three stacked yagis: 23 cm, 70 cm, and 2 meters.</p><p>We would like to extend special thanks to our members who braved the late night in bad weather—We couldn’t have done it without you!</p><p>Karl Robert ES1KRM</p><p>Chris-Robin ES1MUF</p><p>Fredrick ES1REV</p><p>Erki ES1ERKI</p><p>Emil</p><p>Siim ES5KLM</p><p>Heldis ES3EA</p><p>Olev ES3KYZ</p><p>Jocelyn ES3YJ</p><p>Other very welcome guests</p>"
    },
    {
        "id": "tpt_110_years",
        "title": "Tallinn Polytechnic School 110 – Our School’s Story",
        "date": "November 7, 2025",
        "description": "“Tallinn Polytechnic School 110 – Our School’s Story” welcomes warm and heartfelt stories from employees, alumni, partners, and current students alike. Your story can be shared through words, pictures, or film — in written form, photos from the past, or archival footage.",
        "image": "/images/20251013_tpt0174_meie-kooli-lugu_1200x800px_v01.png",
        "content": "<p><strong>“Tallinn Polytechnic School 110 – Our School’s Story”</strong> welcomes warm and heartfelt stories from employees, alumni, partners, and current students alike.</p> <p>Your story can be shared through words, pictures, or film — in written form, photos from the past, or archival footage.</p> <p>The 110-year journey of technical education at Tallinn Polytechnic School is a unique and remarkable chapter in Estonia’s educational landscape — one that deserves to be told to today’s youth and to future generations.</p> <p>Stories are welcome at <strong>meiekoolilugu@tptlive.ee</strong> until the end of 2025.</p> <p><a href=\"https://www.tptlive.ee/et/uudised/tallinna-polutehnikum-110-meie-kooli-lugu\" target=\"_blank\" rel=\"noopener noreferrer\">Read more about the project here.</a></p>"
    },
    {
        "id": "special_call_ES90ERAU",
        "title": "Celebrating 90 Years of the Estonian Radio Amateurs Union",
        "date": "September 30, 2025",
        "description": "A short overview of the Estonian Radio Amateurs Union’s 90th anniversary special event, where operators across Estonia, activated the special callsign ES90ERAU from 20–30 September 2025 to celebrate nine decades of amateur radio activity and community spirit.",
        "image": "/images/ES90ERAU_QSL.jpg",
        "content": "<p>From 20–30 September 2025, Estonian radio amateurs came together on the airwaves to celebrate the 90th anniversary of the Estonian Radio Amateurs Union (ERAU). To mark this milestone, a special event callsign ES90ERAU was active throughout the country, operated by many Estonian hams who joined the effort to make the jubilee memorable and widely heard across the bands.</p> <p>During the 10-day celebration, operators made thousands of QSOs with stations from all around the world, promoting Estonian amateur radio and honoring nine decades of organized amateur radio activity in Estonia.</p> <p>Among the active operators was ES2OA, who contributed to the event with around 150 QSOs. It was a rewarding experience filled with pileups, friendly contacts, and a shared sense of national pride in ERAU’s long and vibrant history.</p> <p>Congratulations to ERAU on 90 years of service to the amateur radio community — here’s to many more years of innovation, friendship, and radio adventure!</p>"
    }
]